# InvalidPlanRegionError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PlanRegionFailures..::..InvalidPlanRegionError Property
BuiltInFailures..::..PlanRegionFailures Class See Also
---
Plan region is invalid. The sketch of a plan region may not contain intersecting, overlapping or nested loops.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidPlanRegionError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidPlanRegionError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidPlanRegionError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PlanRegionFailures Class
Autodesk.Revit.DB Namespace